---
kind: method
id: M:Autodesk.Revit.DB.FabricationItemFolder.Dispose
source: html/fa897e53-97db-2ae7-bcb9-19cea4036072.htm
---
# Autodesk.Revit.DB.FabricationItemFolder.Dispose Method

Releases all resources used by the FabricationItemFolder

## Syntax (C#)
```csharp
public void Dispose()
```